== المعادلات الخطية ==

<table WIDTH="75%"><tr><td style="background-color: #FFF7F7; border: solid 1px #FFBDBD; padding: 1em;" valign=top>
المعادلة الخطية عبارة عن معادلة تأخذ الشكل التالي :

<math>a_1x_1+a_2x_2+\cdots+a_nx_n=b</math>

</td></tr></table>

''a<sub>1</sub>'',''a<sub>2</sub>'', etc. تسمى معاملات المعادلة و ''b'' يدعى الحد الثابت. المتغيرات في الجبر الخطي يرمز لها ب x<sub>n</sub> بدلا من x, y, z,.... الخ.

بسبب كثرة المتغيرات المستخدمة في الجبر الخطي.

الحدود التي تظهر على الجانب الأيسر من المعادلة الخطية يجب أن تكون ذات أس يساوي تماما = 1. في حين تكون الحدود على الجانب الأيمن ذات أ

== جمل المعادلات الخطية ==

<table WIDTH="75%"><tr><td style="background-color: #FFF7F7; border: solid 1px #FFBDBD; padding: 1em;" valign=top>
أي جملة مؤلفة من ''m'' معادلة ذات ''n'' متغير تأخذ الشكل

<math>\begin{matrix}
a_{11}x_1&+a_{12}x_2&\cdots&+a_{1n}x_n&=&b_1\\
a_{21}x_1&+a_{22}x_2&\cdots&+a_{2n}x_n&=&b_2\\
\cdots&\cdots&\cdots&\cdots&\cdots&\\
a_{m1}x_1&+a_{m2}x_2&\cdots&+a_{mn}x_n&=&b_m
\end{matrix}</math>

</td></tr></table>

</td></tr></table>

</td></tr></table>

إذا كان معامل أحد المتغيرات في المعادلة الخطية صفرا عندئذ يمكن اهماله . بالتالي من غير الضروري أن نجد جميع المتغيرات في معادلة واحدة.
 
لنأخذ من المعادلات الخطية :

1. <math>\begin{matrix}2x_1&-2x_2&+x_3&=&1\\-3x_1&+2x_2&&=&3\\3x_1&+2x_2&+x_3&=&7\end{matrix}</math>

2. <math>\begin{matrix}2x_1&-2x_2&-x_3&+2x_4&=&0\\-3x_1&&+2x_3&&=&0\\3x_1&+2x_2&+x_3&-x_4&=&0\end{matrix}</math>

الجملة الثانية نسميها : جملة متجانسة لأن جميع الحدود الثابتة في جميع المعادلات معدومة (صفر) .

عادة تتألف جملة المعادلات الخطية من اثنتين أو أكثر من المعادلات الخطية التي تملك نفس المتغيرات .

نظريا أيضا ، يمكن لنا معاملة جملة خطية وحيدة على أنها جملة مؤلفة من معادلة واحدة .

=== تشكيل المصفوفة ===

نرتب معاملات الجمل الخطية بشكل مصفوفة ''m''-في-''n'' (أي مصفوفة مربعة ذات ''m'' سطر و ''n'' عمود), لنحصل على :

:<math>A=\left(\begin{matrix}
a_{11}&a_{12}&\cdots&a_{1n}\\
a_{21}&a_{22}&\cdots&a_{2n}\\
\cdots&\cdots&\cdots&\cdots\\
a_{m1}&a_{m2}&\cdots&a_{mn}
\end{matrix}\right)</math>

لنجعل :
 
<math>b=\left(\begin{matrix}b_1\\b_2\\\vdots\\b_m\end{matrix}\right)</math>

و

<math>x=\left(\begin{matrix}x_1\\x_2\\\vdots\\x_n\end{matrix}\right)</math>.

يمكن أن تكتب جملة المعادلات الخطية كما يلي :

:<math>Ax=b</math>

كان هذا أحد أهم الدوافع لدراسة نظرية المصفوفات.

 لمعلومات أكثر اقرأ : [[جبر/جبر خطي/المصفوفات|جبر:المصفوفات]].

== حل جمل المعادلات الخطية ==

حل جملة المعادلات الخطية هي مجموعة القيم التي تعطى لكل متغير لكي تصبح مجموعة المعادلات جميعها صحيحة.

مثلا : حل جملة المعادلات المعطاة سلفا هو : (0,1.5,4) لأن :

: 2(0)-1.5(2)+1(4)=1, -3(0)+2(1.5)=3, و 3(0)+2(1.5)+4=7.

[[تصنيف:جبر خطي]]